Tekla.Structures.Drawing.PropertyElement.PropertyElementType
The PropertyElementType class represents the type of a property element.

Tekla.Structures.Drawing.PropertyElement.PropertyElementType.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.